# test_main.py
# !/usr/bin/env python3
""" main.py 单元测试"""

import unittest

from src.pynonjishokei.main import convert_conjugate
from src.pynonjishokei.main import scan_input_string


class TestMain(unittest.TestCase):
    """测试 main.py 中的方法"""

    def test_scan_input_string(self):
        """测试 main.py 中的 scan_input_string 方法"""

        adj_test_cases = [
            ("高い", "高かろう"),
            ("高い", "高かった"),
            ("高い", "高かったり"),
            ("高い", "高くて"),
            ("高い", "高くない"),
            ("高い", "高くても"),
            ("高い", "高くとも"),
            ("高い", "高くなる"),
            ("高い", "高くする"),
            ("高い", "高ければ"),
            ("高い", "高さ"),
            ("高い", "高すぎる"),
            # https://ja.hinative.com/questions/7668939
            # 高いそうです　I heard that it was expensive.
            # 高そうです　　It looks expensive.
            ("高い", "高そう"),
            ("高い", "高み"),
        ]
        self.do_assert_test(adj_test_cases)

        # 一段动词测试
        v1_test_cases = [
            ("食べる", "食べろ"),
            ("食べる", "食べよう"),
            ("食べる", "食べない"),
            ("食べる", "食べなかった"),
            ("食べる", "食べながら"),
            ("食べる", "食べなければならない"),
            ("食べる", "食べます"),
            ("食べる", "食べません"),
            ("食べる", "食べました"),
            ("食べる", "食べましょう"),
            ("食べる", "食べた"),
            ("食べる", "食べたい"),
            ("食べる", "食べたくない"),
            ("食べる", "食べたり"),
            ("食べる", "食べれる"),
            ("食べる", "食べれない"),
            ("食べる", "食べれば"),
            ("食べる", "食べている"),
            ("食べる", "食べていない"),
            ("食べる", "食べていた"),
            ("食べる", "食べても"),
            ("食べる", "食べられる"),
            ("食べる", "食べさせる"),
            # (疲れているあなたのために（東日本大震災）：こころの散歩道)
            # 寝食を忘れている人がいたら、無理にでも、寝かせましょう。　 食べさせましょう。
            # http://www.n-seiryo.ac.jp/~usui/saigai/2011sanrikuoki_eq/tukare.html
            ("食べる", "食べさせましょう"),
            # 食べずに、待っていてください。
            # https://ja.hinative.com/questions/24501639
            ("食べる", "食べずに"),
            # 食べぬけど、待っていてください。
            ("食べる", "食べぬ"),
            # https://yourei.jp/%E9%A3%9F%E3%81%B9%E3%82%8B
            # 昼はそばなどを軽く食べ、夜は酒の肴をあてにひたすら酒を飲んでいた。
            ("食べる", "食べ、"),
            # https://zh.hinative.com/questions/19258409
            # 食べといて=食べておいて＝食べてください
            ("食べる", "食べといて"),
            ("食べる", "食べちゃった"),
            # 「食べせる」より、「食べさせる」のほうが正しいと思うが、「あるもの (存在するもの) すべては正しい（Whatever is, is right.）」
            # https://tsukubawebcorpus.jp/headword/V.00051/#SS57
            # (赤ちゃんの月齢別ＱÅ集〜育児の心得〜)
            # 離乳食はほしがるだけ食べせても大丈夫？
            ("食べる", "食べせても大丈夫"),
            # 日本人がフランスに住むと食生活はこう変わる！　海外のグルメ事情　文化交流　ヨーロッパ　EU　留学　 メシクエブログ〜それいけ神動画〜/ウェブリブログ)
            # 何となくトンペー食べせずにはいられなくなりました。
            ("食べる", "食べせずにはいられなくなりました"),
            # (お客様の声 | 餃子通販 ぎょうざの宝永　札幌本店)
            # 忙しくお仕事大変でしょうがお体大事になさって、もっともっと美味しいぎょうざを研究なさって私達に食べせて下さい
            ("食べる", "食べせて下さい"),
            # https://zh.hinative.com/questions/23333121
            # 「食べんの？」は、普通は「食べるの？」の「る」が「ん」になったものですが、関西の方言などで「食べないの？」という意味になることもあります
            ("食べる", "食べんの？"),
            # 複合動詞
            ("食べる", "食べ始める"),
            # これ美味しそうですねえ。　 食べに行きたいなあ。
            # http://ameblo.jp/closdesoleil/entry-11091942958.html
            ("食べる", "食べに行きたいなあ"),
            ("教える", "教えざるを得ない"),
        ]
        self.do_assert_test(v1_test_cases)

        v5_test_cases = [
            # カ行五段动词
            # 書か-ない/ず/ぬ/れる/せる/せられる/される
            ("書く", "書かない"),
            ("書く", "書かず"),
            ("書く", "書かぬ"),
            ("書く", "書かれる"),
            ("書く", "書かせる"),
            ("書く", "書かせられる"),
            ("書く", "書かされる"),
            # 書き-たい/ます/そうだ/ながら/つつ
            ("書く", "書きたい"),
            ("書く", "書きます"),
            ("書く", "書きそうだ"),
            ("書く", "書きながら"),
            ("書く", "書きつつ"),
            # 書い-て/た/たり/ても
            ("書く", "書いて"),
            ("書く", "書いた"),
            ("書く", "書いたり"),
            ("書く", "書いても"),
            # 書け・書け-ば/る
            ("書く", "書け"),
            ("書く", "書けば"),
            ("書く", "書ける"),
            # 書こう
            ("書く", "書こう"),
            # ガ行
            # 泳が-ない/ず/ぬ/れる/せる/せられる/される
            ("泳ぐ", "泳がない"),
            ("泳ぐ", "泳がず"),
            ("泳ぐ", "泳がぬ"),
            ("泳ぐ", "泳がれる"),
            ("泳ぐ", "泳がせる"),
            ("泳ぐ", "泳がせられる"),
            ("泳ぐ", "泳がされる"),
            # 泳ぎ-たい/ます/そうだ/ながら/つつ
            ("泳ぐ", "泳ぎたい"),
            ("泳ぐ", "泳ぎます"),
            ("泳ぐ", "泳ぎそうだ"),
            ("泳ぐ", "泳ぎながら"),
            ("泳ぐ", "泳ぎつつ"),
            # 泳い-で/だ/だり/でも
            ("泳ぐ", "泳いで"),
            ("泳ぐ", "泳いだ"),
            ("泳ぐ", "泳いだり"),
            ("泳ぐ", "泳いでも"),
            # 泳げ・泳げ-ば/る
            ("泳ぐ", "泳げ"),
            ("泳ぐ", "泳げば"),
            ("泳ぐ", "泳げる"),
            # 泳ごう
            ("泳ぐ", "泳ごう"),
            # サ行
            # 指さ-ない/ず/ぬ/れる/せる/せられる
            ("指す", "指さない"),
            ("指す", "指さず"),
            ("指す", "指さぬ"),
            ("指す", "指される"),
            ("指す", "指させる"),
            ("指す", "指させられる"),
            # 指し-たい/ます/そうだ/ながら/つつ/て/た/たり/ても
            ("指す", "指したい"),
            ("指す", "指します"),
            ("指す", "指しそうだ"),
            ("指す", "指しながら"),
            ("指す", "指しつつ"),
            ("指す", "指して"),
            ("指す", "指した"),
            ("指す", "指したり"),
            ("指す", "指しても"),
            # 指せ・指せ-ば/る
            ("指す", "指せ"),
            ("指す", "指せば"),
            ("指す", "指せる"),
            # 指そう
            ("指す", "指そう"),
            # タ行
            # 立た-ない/ず/ぬ/れる/せる/せられる/される
            ("立つ", "立たない"),
            ("立つ", "立たず"),
            ("立つ", "立たぬ"),
            ("立つ", "立たされる"),
            ("立つ", "立たさせる"),
            ("立つ", "立たさせられる"),
            ("立つ", "立たされる"),
            # 立ち-たい/ます/そうだ/ながら/つつ
            ("立つ", "立ちたい"),
            ("立つ", "立ちます"),
            ("立つ", "立ちそうだ"),
            ("立つ", "立ちながら"),
            ("立つ", "立ちつつ"),
            # 立て・立てば/る
            ("立つ", "立て"),
            ("立つ", "立てば"),
            ("立つ", "立てる"),
            # 立とう
            ("立つ", "立とう"),
            # 立って/た/たり/ても
            ("立つ", "立って"),
            ("立つ", "立った"),
            ("立つ", "立ったり"),
            ("立つ", "立っても"),
            # ナ行
            # 死な-ない/ず/ぬ/れる/せる/せられる/される
            ("死ぬ", "死なない"),
            ("死ぬ", "死なず"),
            ("死ぬ", "死なぬ"),
            ("死ぬ", "死なれる"),
            ("死ぬ", "死なせる"),
            ("死ぬ", "死なせられる"),
            ("死ぬ", "死なされる"),
            # 死に-たい/ます/そうだ/ながら/つつ
            ("死ぬ", "死にたい"),
            ("死ぬ", "死にます"),
            ("死ぬ", "死にそうだ"),
            ("死ぬ", "死にながら"),
            ("死ぬ", "死につつ"),
            # 死ね・死ね-ば/る
            ("死ぬ", "死ね"),
            ("死ぬ", "死ねば"),
            ("死ぬ", "死ねる"),
            # 死の-う
            ("死ぬ", "死のう"),
            # 中島美嘉 - 僕が死のうと思ったのは
            ("死ぬ", "死のうと思ったのは"),
            # 死ん-で/だ/だり/でも
            ("死ぬ", "死ん"),
            ("死ぬ", "死んで"),
            ("死ぬ", "死んだ"),
            ("死ぬ", "死んだり"),
            ("死ぬ", "死んでも"),
            # バ行
            # 飛ば-ない/ず/ぬ/れる/せる/せられる/される
            ("飛ぶ", "飛ば"),
            ("飛ぶ", "飛ばない"),
            ("飛ぶ", "飛ばず"),
            ("飛ぶ", "飛ばぬ"),
            ("飛ぶ", "飛ばれる"),
            ("飛ぶ", "飛ばせる"),
            ("飛ぶ", "飛ばせられる"),
            ("飛ぶ", "飛ばされる"),
            # 飛び-たい/ます/そうだ/ながら/つつ
            ("飛ぶ", "飛びたい"),
            ("飛ぶ", "飛びます"),
            ("飛ぶ", "飛びそうだ"),
            ("飛ぶ", "飛びながら"),
            ("飛ぶ", "飛びつつ"),
            # 飛べ・飛べ-ば/る
            ("飛ぶ", "飛べ"),
            ("飛ぶ", "飛べば"),
            ("飛ぶ", "飛べる"),
            # 飛ぼう
            ("飛ぶ", "飛ぼう"),
            # 飛ん-で/だ/だり/でも
            ("飛ぶ", "飛んで"),
            ("飛ぶ", "飛んだ"),
            ("飛ぶ", "飛んだり"),
            ("飛ぶ", "飛んでも"),
            # マ行
            # 読ま-ない/ず/ぬ/れる/せる/せられる/される
            ("読む", "読まない"),
            ("読む", "読まず"),
            ("読む", "読まぬ"),
            ("読む", "読まれる"),
            ("読む", "読ませる"),
            ("読む", "読ませられる"),
            ("読む", "読まされる"),
            # 読み-たい/ます/そうだ/ながら/つつ
            ("読む", "読みたい"),
            ("読む", "読みます"),
            ("読む", "読みそうだ"),
            ("読む", "読みながら"),
            ("読む", "読みつつ"),
            # 読め・読め-る/ば
            ("読む", "読め"),
            ("読む", "読める"),
            ("読む", "読めば"),
            # 読もう
            ("読む", "読もう"),
            # 読ん-で/だ/だり/でも
            ("読む", "読んで"),
            ("読む", "読んだ"),
            ("読む", "読んだり"),
            ("読む", "読んでも"),
            # ラ行
            # 帰ら-ない/ず/ぬ/れる/せる/せられる/される
            ("帰る", "帰らない"),
            ("帰る", "帰らず"),
            ("帰る", "帰らぬ"),
            ("帰る", "帰られる"),
            ("帰る", "帰らせる"),
            ("帰る", "帰らせられる"),
            ("帰る", "帰らされる"),
            # 帰り-たい/ます/そうだ/ながら/つつ
            ("帰る", "帰りたい"),
            ("帰る", "帰ります"),
            ("帰る", "帰りそうだ"),
            ("帰る", "帰りながら"),
            ("帰る", "帰りつつ"),
            # 帰れ-ば/る
            ("帰る", "帰れば"),
            ("帰る", "帰れる"),
            # 帰ろう
            ("帰る", "帰ろう"),
            # 帰っ-て/た/たり/ても
            ("帰る", "帰って"),
            ("帰る", "帰った"),
            ("帰る", "帰ったり"),
            ("帰る", "帰っても"),
            # ワア行
            # 笑わ-ない/ず/ぬ/れる/せる/せられる/される
            ("笑う", "笑わない"),
            ("笑う", "笑わず"),
            ("笑う", "笑わぬ"),
            ("笑う", "笑われる"),
            ("笑う", "笑わせる"),
            ("笑う", "笑わせられる"),
            ("笑う", "笑わされる"),
            # 笑い-たい/た/たり/ても
            ("笑う", "笑いたい"),
            ("笑う", "笑いた"),
            ("笑う", "笑いたり"),
            ("笑う", "笑いても"),
            # 笑え・笑え-る/ば
            ("笑う", "笑え"),
            ("笑う", "笑える"),
            ("笑う", "笑えば"),
            # 問お
            # 「問おう。あなたがわたしのマスターか」
            ("問う", "問おう"),
        ]
        self.do_assert_test(v5_test_cases)

    def do_assert_test(self, adj_test_cases):
        for expected_result, test_text in adj_test_cases:
            with self.subTest(test_text=test_text, expected_result=expected_result):
                result = scan_input_string(test_text)
                self.assertIn(
                    expected_result,
                    result,
                )

    def test_convert_conjugate_for_rule(self):
        """测试 main.py 中的 convert_conjugate 方法能否正确覆盖所有还原规则
        注意：只测试与原型等长部分能否正确还原为辞书形
        """
        test_cases = {
            # v5
            "書く": ["書か", "書き", "書け", "書こ", "書い"],
            "泳ぐ": ["泳ぐ", "泳ぎ", "泳げ", "泳ご", "泳い"],
            "指す": ["指さ", "指し", "指せ", "指そ"],
            "立つ": ["立た", "立ち", "立て", "立と", "立っ"],
            "死ぬ": ["死な", "死に", "死ね", "死の", "死ん"],
            "飛ぶ": ["飛ば", "飛び", "飛べ", "飛ぼ", "飛ん"],
            "読む": ["読ま", "読み", "読め", "読も", "読ん"],
            "帰る": ["帰ら", "帰り", "帰れ", "帰ろ", "帰っ"],
            # adj
            "高い": ["高か", "高く", "高け", "高さ", "高す", "高み", "高そ"],
            # v1
            "食べる": [
                "食べろ",
                "食べよ",
                "食べな",
                "食べま",
                "食べた",
                "食べれ",
                "食べて",
                "食べら",
                "食べさ",
                "食べず",
                "食べぬ",
                "食べ、",
                "食べと",
                "食べち",
                "食べせ",
                "食べん",
                "食べ",
            ],
        }
        for expected_result, test_case_list in test_cases.items():
            for test_case in test_case_list:
                with self.subTest(expected_result=expected_result, test_case=test_case):
                    result_list = convert_conjugate(test_case)
                    self.assertIn(expected_result, result_list)

    def test_convert_conjugate(self):
        """测试 main.py 中的 convert_conjugate 方法 的各种边界情况"""
        self.assertEqual(None, convert_conjugate(""))

    # def test_convert_nonjishokei(self):
    #     # TODO 测试 convert_nonjishokei 方法，注意该方法和上面 convert_conjugate 的区别在于：这一步要准确判断去除列表后的数据
    #     self.assertEqual()

    # def test_convert_orthography(self):
    # TODO 这个东西测试的意义就在于防止修改之后索引出现问题，所以这一步的测试其实是要遍历查询v2词库中的所有数据么


if __name__ == "__main__":
    unittest.main()
